In [ ]:
"""Find from class_grade, what the lowest rank could be given the grade, order the result by grade ascending"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists class_grade;
CREATE TABLE class_grade (
grade varchar(32) NOT NULL,
number int(4) NOT NULL
);

INSERT INTO class_grade VALUES
('A',2),
('D',1),
('C',2),
('B',2);

In [ ]:
"""SQL solution"""
# 1
SELECT g.grade, CAST(@r := @r + g.number AS SIGNED)
FROM
(SELECT * FROM class_grade ORDER BY grade) AS g,
(SELECT @r := 0) AS rk

# 2
SELECT grade, SUM(number) OVER(ORDER BY grade)
FROM class_grade
ORDER BY grade

In [1]:
"""pandas dataframe creation"""
import pandas as pd

cg = [('A',2),
('D',1),
('C',2),
('B',2)]

class_grade = pd.DataFrame(cg, columns=['grade', 'number'])
class_grade.head()

  grade  number
0     A       2
1     D       1
2     C       2
3     B       2

In [6]:
class_grade['lowest_rank'] = class_grade.sort_values(by='grade')['number'].cumsum()
class_grade.sort_values(by='grade')

  grade  number  lowest_rank
0     A       2            2
3     B       2            4
2     C       2            6
1     D       1            7